; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v4)
             (pred_7 ?v12 ?v2)
             (pred_2 ?v10 ?v2)
             (pred_9 ?v5 ?v10 )
	     (pred_3 ?v10)
             (pred_8 ?v7)
             (pred_10 ?v12)
             (pred_5 ?v2)
             (pred_4 ?v10)
             (pred_1 ?v12)
             (pred_11 ?v10)
             (pred_12 ))



(:action op_2
:parameters (?v1 ?v3 ?v9 ?v6)
:precondition (and (pred_8 ?v1) (pred_8 ?v3) (pred_10 ?v9) (pred_5 ?v6)
          (pred_6 ?v1 ?v3) (pred_7 ?v9 ?v6)
                   (pred_2 ?v3 ?v6) (pred_3 ?v1) 
                   (pred_4 ?v3) (pred_1 ?v9))
:effect (and  (pred_11 ?v3) (not (pred_4 ?v3))))


(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_8 ?v1) (pred_8 ?v8)
               (pred_3 ?v1) (pred_6 ?v1 ?v8) (pred_11 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v1))))

(:action op_4
:parameters (?v1 ?v9)
:precondition (and (pred_8 ?v1) (pred_10 ?v9) 
                  (pred_3 ?v1) (pred_9 ?v9 ?v1) (pred_12 ))
:effect (and (pred_1 ?v9)
   (not (pred_9 ?v9 ?v1)) (not (pred_12 ))))


(:action op_1
:parameters (?v1 ?v13 ?v11)
:precondition (and (pred_8 ?v1) (pred_10 ?v13) (pred_10 ?v11)
                  (pred_3 ?v1) (pred_1 ?v11) (pred_9 ?v13 ?v1))
:effect (and (pred_1 ?v13) (pred_9 ?v11 ?v1)
        (not (pred_1 ?v11)) (not (pred_9 ?v13 ?v1))))

(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_8 ?v1) (pred_10 ?v9) 
                  (pred_3 ?v1) (pred_1 ?v9))
:effect (and (pred_12 ) (pred_9 ?v9 ?v1) (not (pred_1 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_09 obj_15 obj_19 obj_20 obj_05 obj_18 obj_08 obj_12 obj_10 obj_03 obj_04 obj_16 obj_07 obj_01 obj_06
    obj_14 obj_02
    obj_17 obj_13
    )

    (:init
       (pred_12)

       (pred_8 obj_11)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_20)
       (pred_8 obj_05)
       (pred_8 obj_18)
       (pred_8 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_13)

       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_01)
       (pred_4 obj_19)
       (pred_4 obj_20)
       (pred_2  obj_19 obj_14)
       (pred_2  obj_20 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_09)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_11 obj_12)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_06)

       (pred_7  obj_17 obj_14)
       (pred_7  obj_13 obj_02)
       (pred_9 obj_17 obj_16)
       (pred_9 obj_13 obj_06)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_9 obj_13 obj_07)
    ))
(:constraints
  (always (not (pred_3 obj_01)))
)
)

; plan
1. (op_3 obj_10 obj_03)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_03)
   goals met: 0 of 1
2. (op_3 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 0 of 1
3. (op_3 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 1
4. (op_4 obj_06 obj_13)
   deleted: (pred_9 obj_13 obj_06) (pred_12)
   added: (pred_1 obj_13)
   goals met: 0 of 1
5. (op_3 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 0 of 1
7. (op_3 obj_03 obj_10)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_07)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_07)
   goals met: 0 of 1
9. (op_5 obj_07 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_12) (pred_9 obj_13 obj_07)
   goals met: 1 of 1
